# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|")
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
45

45

In [12]:
'´hola'

'´hola'

In [ ]:
pd.

In [ ]:
df.groupby

In [ ]:
pd.

### [ ] Step 4. Discover what is the mean age per occupation

1. vamos a ver la columnas
    - age
    - occupation
2. necesito una funcion que me agrupe segun una columna
3. como buscas esta funcion? `. + tab`
    1. objeto
    2. libreria
    3. predefinida

In [13]:
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [10]:
dfg = df.groupby(by='occupation')
dfg

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
type(dfg)

pandas.core.groupby.generic.DataFrameGroupBy

In [24]:
df.groupby(by='occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [25]:
df.groupby(by='occupation').age.mean().sort_values()

occupation
student          22.081633
none             26.555556
entertainment    29.222222
artist           31.392857
homemaker        32.571429
programmer       33.121212
technician       33.148148
other            34.523810
scientist        35.548387
salesman         35.666667
writer           36.311111
engineer         36.388060
lawyer           36.750000
marketing        37.615385
executive        38.718750
administrator    38.746835
librarian        40.000000
healthcare       41.562500
educator         42.010526
doctor           43.571429
retired          63.071429
Name: age, dtype: float64

In [27]:
s = df.groupby(by='occupation').age.mean().sort_index()

In [29]:
type(s)

pandas.core.series.Series

In [31]:
s.index

Index(['administrator', 'artist', 'doctor', 'educator', 'engineer',
       'entertainment', 'executive', 'healthcare', 'homemaker', 'lawyer',
       'librarian', 'marketing', 'none', 'other', 'programmer', 'retired',
       'salesman', 'scientist', 'student', 'technician', 'writer'],
      dtype='object', name='occupation')

In [32]:
s.values

array([38.74683544, 31.39285714, 43.57142857, 42.01052632, 36.3880597 ,
       29.22222222, 38.71875   , 41.5625    , 32.57142857, 36.75      ,
       40.        , 37.61538462, 26.55555556, 34.52380952, 33.12121212,
       63.07142857, 35.66666667, 35.5483871 , 22.08163265, 33.14814815,
       36.31111111])

In [33]:
s.name

'age'

In [34]:
s.dtypes

dtype('float64')

In [35]:
s

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [37]:
df.index

RangeIndex(start=0, stop=943, step=1)

In [39]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [22]:
dfg.age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [17]:
df.g

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [16]:
dfg.get_group(name='pepe')

KeyError: 'pepe'

In [14]:
dfg.get_group(name='student')

     user_id  age gender occupation zip_code
8          9   29      M    student    01002
29        30    7      M    student    55436
31        32   28      F    student    78741
32        33   23      M    student    27510
35        36   19      F    student    93117
..       ...  ...    ...        ...      ...
927      928   21      M    student    55408
932      933   28      M    student    48105
938      939   26      F    student    33319
940      941   20      M    student    97229
942      943   22      M    student    77841

[196 rows x 5 columns]

In [6]:
df.gender

0      M
1      F
2      M
3      M
4      F
      ..
938    F
939    M
940    M
941    F
942    M
Name: gender, Length: 943, dtype: object

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

### Step 6. For each occupation, calculate the minimum and maximum ages

### Step 7. For each combination of occupation and gender, calculate the mean age

### Step 8.  For each occupation present the percentage of women and men